Week8/A_SwissCheeseFlow/Ac_flowSwissCheesePimple/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{
    "sphereRegion.*"
    {
        type            fixedValue;
        value           uniform 0;
    }

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outside
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
