Week8/A_SwissCheeseFlow/Ac_flowSwissCheesePimple/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication $application
